{"posts":[{"title":"Implementing Kubernetes and Docker on OCI","text":"IntroductionThis was an assignment for Cloud Security class in semester 1, 2022. The requirements asked me to pack a web application into Docker and then deploy the service on the cloud using Kubernetes. The entire lab environment was built on OCI (Oracle Cloud Infrastructure). Here are my configuration notes and the pitfalls I stepped through to help take the easy way out when deploying services to OCI in the future. This diary focuses on the deployment phase. Since OCI has some pre-defined iptables rules that can block communications between nodes, security lists also affect internal communication between VMs, even if they are in the same subnet. I needed to modify the iptables and security lists as below: Pre-Configurationiptables (controller &amp; nodes) Security ListsFor easy configuration, I opened everything, so security lists ended up with only three rules: 0.0.0.0/0; TCP; All ports 0.0.0.0/0; UDP; All ports 0.0.0.0/0; ICMP But make sure that you refer to Kubernetes documentation and related CNI documentation to narrow down the open ports and IP ranges after implementation. ConfigurationAfter the pre-configuration part, we can start installing Kubernetes and Docker on all the VMs. System updates (controller &amp; nodes) Docker (controller &amp; nodes) In daemon.json Then run To check if Cgroup is systemd K8S Installation (controller &amp; nodes) Post-ConfigurationK8S init (controller) --pod-network-cidr: flannel: 10.244.0.0/16 weave: 10.32.0.0/12 calico: 192.168.0.0/16 apply CNI K8S join (nodes) deployement.yml service.yml Check Docker and Kubelet Status Monitor K8S Resources Command to RevertK8S Docker !!! Pitfalls !!! Everything is well configured; I can curl localhost:30033 from nodes or curl [node_ip]:30033 from the controller, but not curl localhost:30033 from the controller. This is because the iptables and security lists block the communication between kube-proxies. Refers to the Pre-Configuration part. Timeout while joining controller from nodes. This is highly due to improper configurations on security lists. We have to open TCP port 6443 for both ways. Pods show running, but the READY state is 0/1 for the DNS pod. This happens when I first implement flannel as my OCI, I finally figured out this issue is also related to iptables. The traffics are DROPPED by rules. dial tcp 127.0.0.1:10248: connect: connection refused when I run kubeadm init. This is because Docker cgroup is not systemd. failed to get config map: Unauthorised while joining nodes to the controller. The token is invalid, run sudo kubeadm token create --print-join-command on the controller to create a new one. Port 10250 is in use This is because kubelet is using this port, run sudo systemctl restart kubelet or sudo kubeadm reset References https://faun.pub/free-ha-multi-architecture-kubernetes-cluster-from-oracle-c66b8ce7cc37 https://medium.com/platformer-blog/running-a-kubernetes-cluster-on-ubuntu-with-calico-9e372fb9175e https://kubernetes.io/docs/setup/production-environment/tools/kubeadm/install-kubeadm/ https://github.com/flannel-io/flannel https://stackoverflow.com/a/60725618 https://kubernetes.io/docs/reference/ports-and-protocols/ https://kubernetes.io/docs/concepts/services-networking/service/ https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/ https://docs.docker.com/engine/reference/commandline/dockerd/ http://www.dest-unreach.org/socat/doc/socat.html#EXAMPLES https://blog.csdn.net/haveanybody/article/details/86494063 https://stackoverflow.com/a/58491408","link":"/2022/04/27/Implementing-Kubernetes-and-Docker-on-OCI/"},{"title":"端口扫描","text":"Nmap NMAP（Network Mapper）is a free and open source utility for network discovery and security auditing. Scan Types I usually use these commands, but the bad sides are time consuming and huge amount of requests. Output Grep Reference -T Options -T0: One port at a time. -T1: 15 seconds RTT. -T2: 0.4 seconds between each requests. Comparing with default option, it uses less bandwidthes and makes less pressures to the servers. -T3: Default options, this includes thread scanning. -T4: If the server is capable, it increases the scanning speed accrodingly. -T5: It sacrifies the accuracy in exchange of the maximum scanning speed. Tips --host-timeout: usually set to 18000 --scan-delay: usually set to 1000 -S: set source address for obsecurity Output Beautify nmapAutomator AutoRecon YujianYujian High Speed Port Scanner (Code: czne). ATTENTION: default threading is too high. MasscanFeatures The fastest scanner in the worlds. It is capable to scan all the ports in 3 minutes. Comparing with Nmap, it is much faster. It uses asynchronous transmission and stateless scanning. A complete TCP connection is not established. A RST packet will be sent once it receives a SYN/ACK packet. (Exception for --banners option) Nmap needs to record the status of TCP/IP, and the TCP/IP connection that OS can handle at the same time is only up to about 1500. It may encounter device interferences, so that there are too many port are open. Advanced Options --adapter-ip: set the source IP address --adapater-port: set the source port --adapter-mac: set the source MAC address --router-mac: set the gateway MAC address --exclude: set IP blacklists to prevent from scanning --excludefile: set IP blacklists from a file --includefile, -iL: scan specific IPs from a file --wait: set wait time after each packet sent, default 10 seconds. Online Port Scanning Nmap UDP Scan Nmap TCP Scan","link":"/2021/08/21/%E7%AB%AF%E5%8F%A3%E6%89%AB%E6%8F%8F/"},{"title":"PHP反序列化之POP链学习 - MRCTF2020-Ezpop","text":"本文以MRCTF2020-Ezpop这一CTF题目为例，详细记录了我在探索PHP POP链反序列化过程中的学习与实践经历，从题目分析、漏洞挖掘到技术实现，旨在提供实战参考与启发。 MRCTF2020-Ezpop 题目分析源码index.php文件如下 Flag被包含在flag.php中 构造 PHP POP 链的过程思路与原理根据最后执行的语句来看 在 if 判断语句中，需要从 pop 参数中拿去序列化字符串后进行反序列化操作。如果没有 pop 参数则直接生成 Show 这个类，然后将当前 PHP 文件直接以彩色格式打印出来。 那么很明显，我们唯一可以利用的就是反序列化了。接下来我们来分析下源码： Modifier 类 这个类有 var 属性是我们可以控制的。 这个类有一个 __invoke() 魔术方法，需要当对象被当作函数调用的时候才能触发。 这个 __invoke() 魔术方法中调用了 append() 这个方法，并将 var 属性的值传入进去。 append() 方法中又包含了一个 include() 方法。 所以最后 var 属性的值被 include() 方法给包含了。 综上所述，如果能触发 __invoke() 魔术方法、并控制 var 属性的值，则可以实现文件包含。 Show 类 这个类有 source、str 属性是我们可以控制的。 这个类有一个 __construct() 魔术方法，需要当对象被创建时才能触发。 这个 __construct() 魔术方法将 index.php 这个值保存在 source 属性中，并打印出 Welcome to index.php。 这个类有一个 __toString() 魔术方法，需要当对象被当作字符串的时候才能触发。 这个 __toString() 魔术方法中返回了 $this-&gt;str-&gt;source，假设 $this-&gt;str 是另一个类的实例，当访问 source 属性的时候，如果该属性不存在，则会触发 __get() 魔术方法。 这个类有一个 __wakeup() 魔术方法，需要在反序列化时触发。 这个 __wakeup() 魔术方法中首先检查 source 属性是否包含一些危险的协议（在检查的过程中，会触发 __toString() 魔术方法，当然这里需要是对象被当作字符串使用才行）。如果存在，则打印 hacker，并将 index.php 这个值保存在 source 属性中。不过黑名单的方式总是可以绕过的。 Test 类 这个类有 p 属性是我们可以控制的。 这个类有一个 __construct() 魔术方法，需要当对象被创建时才能触发。 这个 __construct() 魔术方法将 p 属性初始化为一个空数组。 这个类有一个 __get() 魔术方法，需要当访问不可访问的属性（protected 或 private)或不存在的属性的时候才能触发。 这个 __get() 魔术方法将 p 属性的值保存在 function 属性中，并把 function 属性作为函数返回。这时，联系到 Modifier 类，如果 p 属性是 Modifier 类的实例，那么将对象作为函数调用返回，就会触发 Modifer 类中的__invoke() 魔术方法。 这就是对整个代码的解读，这时候就需要将POP链串起来了： 首先在 if 判断语句中，反序列化会调用 Show 类中的 __wakeup() 魔术方法。 接着在 __wakeup() 魔术方法中 $this-&gt;source 属性作为 Show 的另一个实例触发了 Show 中的 __toString() 魔术方法。 __toString() 魔术方法中 $this-&gt;str 属性如果是 Test 类，调用 source 这个不存在的属性的时候就会触发 __get() 魔术方法。$this-&gt;str 属性肯定不能是 Modifier 类，因为 Modifier 类中没有 __get() 魔术方法用来触发。 在 __get() 魔术方法中将 Modifer 类实例作为 $this-&gt;p 放在 function 属性中，当作函数调用，触发 Modifier 类中的 __invoke() 魔术方法后使用 append() 方法包含 var 属性中的文件。 最后只需要将文件路径传入我们可以控制的属性 var 即可。 最后 POP 链如下：Show::__wakup() &gt; Show::__toString() &gt; Test::__get() &gt; Modifier::__invoke() &gt; Modifier::append &gt; include 具体步骤做这种反序列化题，首先我们把可控的类、属性等拷贝到新的文件 payload.php： 根据POP利用链初始化类： 将它们串起来： 最后因为是打算在浏览器中发送序列化后的字符串，以 urlencode() 方式打印出这些字符串： 最终的 Payload 为： 漏洞利用演示与结果利用流程展示执行 payload.php 生成 Payload： 发送请求包： 得到返回的 Base64 编码后的结果。 攻击结果将 Base64 编码后的内容解码后得到 Flag：","link":"/2025/02/08/PHP%E5%8F%8D%E5%BA%8F%E5%88%97%E5%8C%96%E4%B9%8BPOP%E9%93%BE%E5%AD%A6%E4%B9%A0-MRCTF2020-Ezpop/"},{"title":"A Comprehensive Comparison Between Virtual Hosts and Subdomains","text":"Virtual HostsVirtual hosts are websites running on multiple domains on the same physical server, and these units are independent of each other. They can have their own separate domain names, IP addresses, and website content, but they share the same server and operating system, as shown below: Web users can access a specific website by domain name, IP address, or port, as shown in the figure below: Virtual hosts are typically used in the following scenarios: Hosting multiple websites with different domain names on a single server; Saving server resources and costs. TypesThere are 3 types of virtual hosts: 1) URL-based; 2) IP address-based; and 3) port-based, as shown in the table below: URL-Based IP Address-Based Port-Based Depending on Host Header Yes No Yes - URL UsedNo - IP Addresses Used Multi IP Address Requirements No Yes No - URL UsedYes - IP Addresses Used SSL/TLS Protocol Limitation Yes No Yes - URL UsedNo - IP Addresses Used Efficiency High Medium Medium Flexibility High Medium Medium Usability High Low Medium Security Medium High Medium - URL UsedHigh - IP Addresses Used DNS ResolutionVirtual hosting is implemented at the configuration level of a web server and allows multiple websites to be hosted on a single server. In the DNS resolution process, each virtual host usually corresponds to one or more domain names, and the DNS server resolves these domain names to point to the server with the same IP address. After receiving a HTTP request, the web server decides which virtual host’s content and resources to respond to the user based on the Host header in the request packet. However, public DNS usually cannot resolve some virtual hosts, mainly because public DNS does not have the correct A record, AAAA record, or CNAME record, and these virtual hosts share the same IP address and run on the same physical machine. In this case, the only way to distinguish between different websites is through the Host header information in the HTTP request. If you need to access these virtual hosts in a browser, one way to achieve this is to manually add DNS resolution records in the /etc/host file (Linux) or in the C:\\Windows\\System32\\drivers\\etc\\hosts file (Windows). Potential Security ConcernsMisconfiguration Misconfigured virtual hosts can cause websites with different domain names to leak each other’s sensitive information. As an example, let’s say there is a web server with a public IP of 1.1.1.1 and hosting two websites example.com and a.example.com. Failure to properly distinguish between the directories corresponding to the two domains may result in a.example.com being accessed with the contents of example.com, or a.example.com being accessed with the contents of example.com. Access Control Concerns There may be access controls that are not properly configured, allowing unauthorized access to the contents of the virtual host. In Apache, access control is usually configured 1) globally in the httpd.conf file, and 2) specifically in the configuration file corresponding to each virtual host (e.g., in the directory /etc/apache2/sites-available). The following are some of the settings in the virtual host configuration, where Order, Allow, Deny, etc. define the access control rules for the virtual host. In Nginx, similar to Apache, global configuration can be configured in the nginx.conf file, and a separate virtual host configuration file is located in the /etc/nginx/sites-available directory. As follows, the allow parameter in the location block defines the access control rules for the virtual host. Therefore, the following considerations need to be taken into account in the access control definitions: Determine access requirements based on the business context and limit access to IP addresses with Allow and Deny parameters; Authentication mechanisms can be integrated into security controls if needed; Logging would need to be enabled to ensure that exceptions can be logged and regular log reviews are performed. Virtual Host EnumerationIn general, URL-based virtual host is one of the most common practices, and we can use different tools for virtual host enumeration: Gobuster: gobuster vhost -u http(s)://&lt;TARGET&gt; -w &lt;WORDLIST_FILE&gt; --append-domain Ffuf: ffuf -w &lt;WORDLIST_FILE&gt;:FUZZ -u http(s)://&lt;TARGET&gt; -H 'Host: FUZZ.&lt;TARGET&gt;' Nmap: nmap -p &lt;PORT&gt; --script http-vhosts &lt;TARGET&gt; Nikto: nikto -h &lt;TARGET_IP&gt; -p &lt;PORT&gt; -vhost &lt;TARGET_URL&gt; SubdomainsAfter discussing virtual hosts, there is no mandatory requirement for subdomains to share the same server and operating system as virtual hosts do. Subdomains are subdivisions of the main domain name and are often used to distinguish between different services, departments, or geographic locations. Subdomains can be set up with DNS records (such as A records, AAAA records, or CNAME records), which can point to different IP addresses or different ports on the same IP address. Subdomains are typically used in the following scenarios: Separating different services or departments under the main domain name; Providing different websites or services without the need for additional domain names. DNS ResolutionA subdomain is a branch under the main domain name, which is usually used to separate different services, departments, or geographical locations under the main domain name. In public DNS, subdomains are usually available for resolution (i.e., A records, AAAA records, or CNAME records can be found.) In the DNS resolution process, the browser will find the corresponding IP address based on the DNS record, and then sends requests to that IP address. Potential Security Concerns Unauthorized Access: Some subdomains may not be properly protected, which may result in the disclosure of sensitive information or unauthorized access. Subdomain Hijacking: If an attacker is able to tamper with DNS records or use DNS cache poisoning attacks, they are able to hijack subdomain traffic and perform malicious actions such as man-in-the-middle (MITM) attacks or stealing sensitive information. Subdomain EnumerationsThere are different tools we can use to enumerate subdomains: DNSEnum: dnsenum --enum &lt;TARGET&gt; -f &lt;WORDLIST_FILE&gt; -r Ffuf: ffuf -w &lt;WORDLIST_FILE&gt;:FUZZ -u http(s)://FUZZ.&lt;TARGET&gt; Amass: amass enum -d &lt;TARGET&gt; Assetfinder: assetfinder --subs-only &lt;TARGET&gt; DNSRecon: dnsrecon -d &lt;TARGET&gt; DIG Zone Transfer: dig axfr @&lt;NS_ADDRESS&gt; &lt;TARGET&gt; ConclusionBy learning about virtual hosts and subdomains, I have learnt that virtual hosts are a special type of subdomain. Virtual hosts require sharing the same server and operating system, and some domain names for virtual hosts are not resolvable in the public DNS. On the other hand, subdomains are able to get domain names resolved in public DNS easily.","link":"/2024/08/09/A-Comprehensive-Comparison-Between-Virtual-Hosts-and-Subdomains/"}],"tags":[{"name":"OCI","slug":"OCI","link":"/tags/OCI/"},{"name":"Docker","slug":"Docker","link":"/tags/Docker/"},{"name":"Kubernetes","slug":"Kubernetes","link":"/tags/Kubernetes/"},{"name":"NodePort","slug":"NodePort","link":"/tags/NodePort/"},{"name":"Nmap","slug":"Nmap","link":"/tags/Nmap/"},{"name":"御剑","slug":"御剑","link":"/tags/%E5%BE%A1%E5%89%91/"},{"name":"信息收集","slug":"信息收集","link":"/tags/%E4%BF%A1%E6%81%AF%E6%94%B6%E9%9B%86/"},{"name":"PHP","slug":"PHP","link":"/tags/PHP/"},{"name":"反序列化","slug":"反序列化","link":"/tags/%E5%8F%8D%E5%BA%8F%E5%88%97%E5%8C%96/"},{"name":"POP链","slug":"POP链","link":"/tags/POP%E9%93%BE/"},{"name":"虚拟主机","slug":"虚拟主机","link":"/tags/%E8%99%9A%E6%8B%9F%E4%B8%BB%E6%9C%BA/"},{"name":"子域名","slug":"子域名","link":"/tags/%E5%AD%90%E5%9F%9F%E5%90%8D/"}],"categories":[{"name":"运维","slug":"运维","link":"/categories/%E8%BF%90%E7%BB%B4/"},{"name":"安全","slug":"安全","link":"/categories/%E5%AE%89%E5%85%A8/"},{"name":"主机安全","slug":"安全/主机安全","link":"/categories/%E5%AE%89%E5%85%A8/%E4%B8%BB%E6%9C%BA%E5%AE%89%E5%85%A8/"},{"name":"Web安全","slug":"安全/Web安全","link":"/categories/%E5%AE%89%E5%85%A8/Web%E5%AE%89%E5%85%A8/"},{"name":"信息收集","slug":"安全/主机安全/信息收集","link":"/categories/%E5%AE%89%E5%85%A8/%E4%B8%BB%E6%9C%BA%E5%AE%89%E5%85%A8/%E4%BF%A1%E6%81%AF%E6%94%B6%E9%9B%86/"},{"name":"PHP","slug":"安全/Web安全/PHP","link":"/categories/%E5%AE%89%E5%85%A8/Web%E5%AE%89%E5%85%A8/PHP/"},{"name":"信息收集","slug":"安全/Web安全/信息收集","link":"/categories/%E5%AE%89%E5%85%A8/Web%E5%AE%89%E5%85%A8/%E4%BF%A1%E6%81%AF%E6%94%B6%E9%9B%86/"}],"pages":[{"title":"Categories","text":"","link":"/categories/"},{"title":"Link","text":"","link":"/link/"},{"title":"About","text":"","link":"/about/"},{"title":"Message Board","text":"","link":"/messageboard/"},{"title":"Tags","text":"","link":"/tags/"}]}